# **Pandas 10 - Mengganti Nama Kolom pada Data Frame Berdasarkan Pola**

# Import Modules

In [7]:
import pandas as pd

print(pd.__version__)

2.1.1

# Persiapan Data Frame

- Kali ini kita memuat csv titanicfull kedalam data frame 'df'.
- Nama kolom ini disesuaikan agar cocok dengan materi yang ingin disampaikan pada trik ini.
- Fungsi head() berguna untuk menampilkan 5 baris awal saja.

In [8]:
# Menggunakan metode read_csv dari pandas untuk membaca file CSV (Comma-Separated Values) 
# dan menyimpannya dalam data frame df. Kemudian, melakukan salinan mendalam (deep copy) dari df dan menyimpannya dalam df_backup.
# Kolom-kolom dalam data frame diubah menjadi versi yang lebih bersih dan mudah dibaca.
df = pd.read_csv('./data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'Full Name', 'Sex', 'Age', 
              'Siblings/Spouses Aboard', 'Parents/Children Aboard', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

# Menampilkan lima data awal dari data frame
df.head()

,Pclass,Survival status,Full Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S


# Menggunakan Lowercase untuk Nama Kolom dan Mengganti Spasi dengan _

- Fungsi str.replace() berguna untuk menggantikan suatu string menjadi string lainnya.
- Fungsi str.lower() berguna untuk mengubah semua string menjadi lower case.
- Pada kasus kali ini kita mendapat sebuah masalah pada kolom sex dan age.

In [9]:
# Metode str.replace untuk mengganti spasi dengan garis bawah (_) dalam label kolom
# Metode str.lower untuk mengubah semua huruf dalam label kolom menjadi huruf kecil
# Operasi ini dilakukan untuk memastikan label kolom menjadi lebih bersih dan seragam
df.columns = df.columns.str.replace(' ', '_').str.lower()

# Menampilkan lima data awal dari data frame setelah penggantian dan penyesuaian label kolom
df.head()

,pclass,survival_status,full_name,sex,age,siblings/spouses_aboard,parents/children_aboard,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Memangkas Kelebihan Spasi pada Nama Kolom

- Fungsi str.strip() berguna untuk memotong/ menghilangkan kelebihan spasi di sisi kiri maupun kanan.

In [10]:
# Membuat salinan mendalam (deep copy) dari data frame df_backup dan menyimpannya dalam variabel df
df = df_backup.copy(deep=True)

# Metode str.lower untuk mengubah semua huruf dalam label kolom menjadi huruf kecil
# Metode str.strip untuk menghapus spasi di awal dan akhir label kolom
# Metode str.replace untuk mengganti spasi dengan garis bawah (_) dalam label kolom
# Operasi ini dilakukan untuk memastikan label kolom menjadi lebih bersih dan seragam
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')

# Menampilkan lima data awal dari data frame setelah penggantian dan penyesuaian label kolom
df.head()

,pclass,survival_status,full_name,sex,age,siblings/spouses_aboard,parents/children_aboard,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S